bot.onText(/\/start/, (msg) => {
  const chatId = msg.chat.id;

  const welcomeMessage = `🐟 Добро пожаловать в IKRU MNE! 🦀🦐🦑\n\nВыбирай свежие деликатесы и заказывай прямо в боте.`;

  const options = {
    reply_markup: {
      inline_keyboard: [
        [{ text: "🛒 Магазин", url: miniAppUrl }],
        [{ text: "ℹ️ О нас", callback_data: 'about' }],
        [{ text: "💳 Оплата", callback_data: 'payment' }],
        [{ text: "🚚 Доставка", callback_data: 'delivery' }],
        [{ text: "📞 Контакты", callback_data: 'contacts' }]
      ]
    }
  };

  bot.sendMessage(chatId, welcomeMessage, options);
});

// Обработка кнопок
bot.on('callback_query', (query) => {
  const chatId = query.message.chat.id;
  const data = query.data;

  if (data === 'about') {
    bot.sendMessage(chatId, ` Добро пожаловать в группу IKRU 🧡 MNE! \n\nЗдесь вы найдете лучшие деликатесы: свежую малосольную красную икру и отборную красную рыбу. 🥄🐟\n\nНаша продукция не содержит консервантов и добавок. Мы предлагаем только свежие и качественные продукты. Для заказа пишите: @ikraMonte`);
  } 
  else if (data === 'payment') {
    bot.sendMessage(chatId, `💳 Оплата только при получении заказа наличными. \nМы гарантируем, что вы платите только за свежую продукцию при доставке.`);
  } 
  else if (data === 'delivery') {
    bot.sendMessage(chatId, `🚚 Доставка по всей Черногории 🇲🇪\nМы доставляем точно в срок и сохраняем свежесть продукции. ❄️`);
  } 
  else if (data === 'contacts') {
    bot.sendMessage(chatId, `📞 Связь: +382 69 575 828\nTelegram: @IKRAmne_bot\nГруппа: https://t.me/ikru_mne`);
  }
});